###################
# Составьте выражение для вычисления указанной ниже формулы и
# вставьте в поле ответа вывод интерпретатора после вычисления
# этого выражения.
#############################
# print(42 / (4 + 2 * (-2)))

#############################
# Составьте выражение для вычисления в интерпретаторе Python 3
# и вставьте в поле ответа результат вычисления:
# 2014 in 14
#######################
# print(2014**14)
# print(9 ** 19)
# print(int(float(9 ** 19)))
# print(9 ** 19 - int(float(9 ** 19)))
a = int(input('Введите данные:  '))
print(a)
