##########################
# Выполните код в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления.
# Постарайтесь разобраться, почему интерпретатор выдал именно такой ответ. Помните,
# что любые арифметические операции выше по приоритету операций сравнения и логических операторов.
#
# Помните, что в Python логические значения пишутся с большой буквы: True, False.
################################

# x = 5
# y = 10
# print(y > x * x or y >= 2 * x and x < y)
#
# Найдите результат выражения для заданных значений aa и bb. Учитывайте регистр символов при ответе.

a = True
b = False
print(not a)
print(not b)
print(a and b or not a and not b)
