"""
Напишите программу, считывающую с пользовательского ввода целое число nn (неотрицательное),
выводящее это число в консоль вместе с правильным образом изменённым словом "программист",
для того, чтобы робот мог нормально общаться с людьми, например:
1 программист, 2 программиста, 5 программистов.
"""
count = int(input())
if 11 <= count % 100 <= 14 or 5 <= count <= 20 or count == 0 or 5 <= count % 10 <= 9 or count % 10 == 0:
    print(count, "программистов")
elif count % 10 == 1:
    print(count, "программист")
else:
    print(count, "программиста")

# a = int(input())
# b = 'программист'
# c = 'программиста'
# d = 'программистов'
# M = a % 100
# if 11 <= M <= 14:
#     print(a, d)
# else:
#     n = a % 10
#     if n == 0 or 5 <= n <= 9:
#         print(a, d)
#     elif n == 1:
#         print(a, b)
#     else:
#         print(a, c)


# i = int(input())
# d = i % 10
# h = i % 100
# if d == 1 and h != 11:
#     s = ""
# elif 1 < d < 5 and not 11 < h < 15:
#     s = "а"
# else:
#     s = "ов"
# print(i, " программист" + s)

# n = int(input())
# if n % 10 == 1 and n % 100 != 11:
#     print(n, 'программист')
# elif n % 10 in [2, 3, 4] and not n % 100 in [12, 13, 14]:
#     print(n, 'программиста')
# else:
#     print(n, 'программистов')

# x = int(input())
# if x % 100 in (11, 12, 13, 14) or x % 10 in (5, 6, 7, 8, 9, 0):
#     print(x, 'программистов')
# elif x % 10 in (2, 3, 4):
#     print(x, 'программиста')
# else:
#     print(x, 'программист')
